## [test](https://t-nysdin.app.spacelift.io/stack/test/run/01H0GTEE66EGAKAWDQDDXEN8M9) plan logs

<details>
<summary>Click here to expand</summary>

```
[01H0FA5TKSJCHB5MQ5B5JYB9CZ] Planning changes with 0 custom hooks...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_ssm_parameter.spacelift_test will be created
  + resource "aws_ssm_parameter" "spacelift_test" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/spacelift/test"
      + tags_all       = {
          + "Managed_by" = "nysdin/k8s_intro"
          + "Terraform"  = "true"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

[01H0FA5TKSJCHB5MQ5B5JYB9CZ] Changes are GO
[01H0FA5TKSJCHB5MQ5B5JYB9CZ] Uploading the list of managed resources...
[01H0FA5TKSJCHB5MQ5B5JYB9CZ] Please be aware that Run changes calculation includes Terraform output changes.
[01H0FA5TKSJCHB5MQ5B5JYB9CZ] Resource list upload is GO
[01H0FA5TKSJCHB5MQ5B5JYB9CZ] Generating JSON representation of the plan...
[01H0FA5TKSJCHB5MQ5B5JYB9CZ] JSON representation is GO
[01H0FA5TKSJCHB5MQ5B5JYB9CZ] Loading custom plan policy inputs...
[01H0FA5TKSJCHB5MQ5B5JYB9CZ] 0 custom plan policy inputs found
[01H0FA5TKSJCHB5MQ5B5JYB9CZ] No plan policies to evaluate
```

</details>